In [ ]:
import pandas as pd
import numpy as np
import re
from matplotlib import pyplot as plt
import xlrd

In [ ]:
import missingno

In [ ]:
import os
df=pd.read_csv("/content/sample_data/GSAF5.csv")

In [ ]:
file_list = [f for f in df]
print(file_list)
df.shape

['Case Number', 'Date', 'Year', 'Type', 'Country', 'Area', 'Location', 'Activity', 'Name', 'Sex ', 'Age', 'Injury', 'Fatal (Y/N)', 'Time', 'Species ', 'Investigator or Source', 'pdf', 'href formula', 'href', 'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22', 'Unnamed: 23']

(25827, 24)

## ***CASE NUMBER***

In [ ]:
print(df['Case Number'].equals(df['Case Number.1']))
print(df['Case Number.1'].equals(df['Case Number.2']))
print(df['Case Number'].equals(df['Case Number.2']))
case_number=df[["Case Number","Case Number.1","Case Number.2"]]
# not_equal = case_number[case_number["Case Number"]!=case_number["Case Number.1"]]
not_equal = case_number[case_number["Case Number"]!=case_number["Case Number.2"]]
#not_equal = case_number[case_number["Case Number.1"]!=case_number["Case Number.2"]]
display(not_equal)

False
False
False

        Case Number Case Number.1 Case Number.2
83              NaN  2021.01.13.b  2021.01.13.b
164      2020.05.26           NaN           NaN
766      2015.07-10    2015.07.10    2015.07.10
5340   1934.01.08.R  1934.02.08.R  1934.02.08.R
5879            NaN  1905.09.06.R  1905.09.06.R
...             ...           ...           ...
25822           NaN           NaN           NaN
25823           NaN           NaN           NaN
25824           NaN           NaN           NaN
25825           NaN           NaN           NaN
25826            xx           NaN           NaN

[19138 rows x 3 columns]

In [ ]:
df['Case Number.1'].isin(df['Case Number.2']).value_counts()

True     25789
False       38
Name: Case Number.1, dtype: int64

In [ ]:
df = df.drop(columns=["Case Number"])

In [ ]:
case_number2=df[["Case Number.1","Case Number.2"]]
not_equal = case_number2[case_number2["Case Number.1"]!=case_number2["Case Number.2"]]
display(not_equal)

       Case Number.1  Case Number.2
6        2021. 08.21     2021.08.21
9      2021..08.07.b   2021.08.07.b
10      2021.08.07.a  2021..08.07.a
73        2021.02.20     2021.02.21
81      2021.01.22.a     2021.01.22
...              ...            ...
25822            NaN            NaN
25823            NaN            NaN
25824            NaN            NaN
25825            NaN            NaN
25826            NaN            NaN

[19167 rows x 2 columns]

In [ ]:
df = df.drop(columns=["Case Number.1"])

In [ ]:
df.rename(columns={"Case Number.2":"Case Number"}, inplace=True)

In [ ]:
df['Case Number'] = df['Case Number'].replace(",",".",regex=False)

In [ ]:
df.rename(columns={"Sex ":"Sex"}, inplace=True)
df.rename(columns={"Species ":"Species"}, inplace=True)

In [ ]:
df=df[["Case Number","Date","Year","Sex","Type","Species","Country", "Area", "Location", "Activity", "Age", "Fatal (Y/N)", "Time"]]

In [ ]:
df.columns.drop_duplicates()

Index(['Case Number', 'Date', 'Year', 'Sex', 'Type', 'Species', 'Country',
       'Area', 'Location', 'Activity', 'Age', 'Fatal (Y/N)', 'Time'],
      dtype='object')

## ***COLUMN AGE***

In [ ]:
df['Age'].value_counts().sample(20)

68              8
31 or 33        1
?    &   14     1
25 or 28        1
32             76
!6              1
!!              1
mid-20s         1
12 or 13        1
50s             3
46 & 34         1
Both 11         1
8 or 10         2
28 & 22         1
7 or 8          2
18 to 22        1
8              31
30 or 36        1
5               7
6½              1
Name: Age, dtype: int64

In [ ]:
df['Age'].replace(to_replace=['Teen','teen'],value='16',inplace=True)
df['Age'].replace(to_replace='30s',value='35',inplace=True)
df['Age'].replace(to_replace='20s',value='25',inplace=True)
df['Age'] = pd.to_numeric(df['Age'], errors='coerce', downcast='integer')
df['Age'].value_counts().head(20)

17.0    167
16.0    160
18.0    155
19.0    148
20.0    147
15.0    146
25.0    125
21.0    124
22.0    119
14.0    111
24.0    110
13.0     99
26.0     90
23.0     87
35.0     85
28.0     85
12.0     84
29.0     84
30.0     82
27.0     82
Name: Age, dtype: int64

 ## ***Column Country***

In [ ]:
filtered = df[(df['Country'].isnull())]

print(filtered.shape)

(19177, 13)

In [ ]:
df['Country'] = df['Country'].str.replace('ENGLAND', 'UNITED KINGDOM')
df['Country'] = df['Country'].str.replace('SCOTLAND', 'UNITED KINGDOM')

filtered = df[(df['Country']=="UNITED KINGDOM")]
print(filtered.shape)
filtered.head()

(43, 13)

       Case Number                  Date    Year  ...   Age Fatal (Y/N)   Time
43      2021.06.12           12-Jun-2021  2021.0  ...  51.0           N    NaN
384   2018.05.13.a           13-May-2018  2018.0  ...  21.0           N  08h15
509   2017.06.07.R  Reported 07-Jun-2017  2017.0  ...  30.0           N    NaN
1125    2012.08.31           31-Aug-2012  2012.0  ...  53.0           N    NaN
1224  2011.10.28.R  Reported 28-Oct-2011  2011.0  ...  26.0           N    NaN

[5 rows x 13 columns]

In [ ]:
counts=df['Country'].value_counts()
display(counts)

USA                               2428
AUSTRALIA                         1429
SOUTH AFRICA                       589
NEW ZEALAND                        139
PAPUA NEW GUINEA                   136
                                  ...
British Overseas Territory           1
BRITISH VIRGIN ISLANDS               1
ANGOLA                               1
FEDERATED STATES OF MICRONESIA       1
RED SEA / INDIAN OCEAN               1
Name: Country, Length: 215, dtype: int64

## ***COLUMN FATAL***

In [ ]:
df["Fatal (Y/N)"].value_counts()

N          4634
Y          1427
UNKNOWN      71
 N            7
F             2
2017          1
M             1
y             1
Y x 2         1
Nq            1
N             1
Name: Fatal (Y/N), dtype: int64

In [ ]:
df["Fatal (Y/N)"] = df["Fatal (Y/N)"].str.strip()

In [ ]:
def FATAL(f): 
    if f not in ["N", "Y"]: 
        return 'Unknown'
    else: 
        return f
    
df["Fatal (Y/N)"] = df["Fatal (Y/N)"].apply(FATAL)
df["Fatal (Y/N)"].value_counts()

Unknown    19758
N           4642
Y           1427
Name: Fatal (Y/N), dtype: int64

## ***Column type***

In [ ]:
df["Type"] = df["Type"].str.strip() 
df["Type"].value_counts()

Unprovoked             4908
Provoked                613
Invalid                 552
Watercraft              350
Sea Disaster            240
Questionable             12
Boat                      7
Unconfirmed               1
Under investigation       1
Unverified                1
Name: Type, dtype: int64

In [ ]:
df["Type"] = df["Type"].str.replace('Invalid', 'Unspecified').str.replace('Questionable', 'Unspecified').str.replace('Unconfirmed', 'Unspecified').str.replace('Unverified', 'Unspecified').str.replace('Under investigation', 'Unspecified')

In [ ]:
df["Type"] = df["Type"].str.replace('Sea Disaster', 'Unprovoked')
df["Type"] = df["Type"].str.replace('Boat', 'Provoked').str.replace('Watercraft','Provoked')

In [ ]:
df["Type"].value_counts()

Unprovoked     5148
Provoked        970
Unspecified     567
Name: Type, dtype: int64

## ***Column time***

In [ ]:
df['Time'] = df['Time'].str.strip()
df['Time'] = df['Time'].str.lower()
df.loc[df['Time'].notnull(),'Time'].sample(20)

4207      07h00
272       09h00
2938      09h45
75        19h00
629       22h00
817       11h45
1182      17h00
2260      19h15
448       12h30
3077      18h00
3580      13h00
128     morning
1821      11h00
249       07h30
872       11h00
3185      11h00
727       13h00
1269      10h00
4131      08h00
6345    evening
Name: Time, dtype: object

In [ ]:
df.loc[(df['Time'].notnull()) & (df['Time'].str.fullmatch('[a-zA-Z]{3,}')),'Time'].value_counts()

afternoon    205
morning      131
night         64
evening       38
dusk          16
midday        11
sunset         6
midnight       4
dawn           2
dark           2
nightfall      1
daybreak       1
lunchtime      1
daytime        1
noon           1
Name: Time, dtype: int64

In [ ]:
df['Time'].replace(['.*evening.*','.*dusk.*',
                         '.*dark.*','.*night.*'],'night',regex=True,inplace=True)

df['Time'].replace(['pm','p\.m\.','.*midday.*','.*sunset.*','.*lunchtime.*',
                         '.*noon.*','.*daytime.*','.*afternoon.*'],'afternoon',regex=True,inplace=True)

df['Time'].replace(['a\.m\.''am','.*dawn.*',
                         '.*daybreak.*','.*morning.*'],'day-morning',regex=True,inplace=True)

In [ ]:
df.loc[(df['Time'].notnull()) & (df['Time'].str.fullmatch('\w{3,}')),'Time'].value_counts()

afternoon    293
11h00        138
night        137
12h00        117
15h00        116
            ...
12h54          1
12h39          1
05h40          1
10h43          1
13h06          1
Name: Time, Length: 276, dtype: int64

In [ ]:
#grouping 06:00 to 11:59 as day-morning 
df['Time'].replace(to_replace='.*0[6-9].?\d{2}.*',value='day-morning',regex=True,inplace=True)
df['Time'].replace(to_replace='.*1[0-1].?\d{2}.*',value='day-morning',regex=True,inplace=True)
#grouping 12:00 to 17:59 as afternoon
df['Time'].replace(to_replace='.*1[2-7].?\d{2}.*',value='afternoon',regex=True,inplace=True)
#grouping 18:00 to 23:59 as night
df['Time'].replace(to_replace='.*1[8-9].?\d{2}.*',value='night',regex=True,inplace=True)
df['Time'].replace(to_replace='.*2[0-3].?\d{2}.*',value='night',regex=True,inplace=True)
#grouping 00:00 to 05:59 as night-morning
df['Time'].replace(to_replace='.*0[0-5].?\d{2}.*',value='night-morning',regex=True,inplace=True)

In [ ]:
df[~df['Time'].isin(['day-morning','night-morning','night','afternoon'])]['Time'].count()

33

In [ ]:
df.loc[~df['Time'].isin(['day-morning','night-morning','night','afternoon']),'Time'] = np.nan

In [ ]:
df['Time'].value_counts(dropna=False)

NaN              22615
afternoon         1741
day-morning       1044
night              383
night-morning       44
Name: Time, dtype: int64

In [ ]:
df['Time']= df['Time'].fillna("Unspecified")

## ***Column Activity***

In [ ]:
df['Activity'].replace(['JUMPING','STANDING','WADING','WALKING','PLAYING','SPLASHING','DANGLING FEET IN THE WATER'],'BATHING',inplace=True)
df['Activity'].replace(['BODY SURFING','BOOGIE BOARDING','BODY-BOARDING'],'BODY BOARDING',inplace=True)
df['Activity'].replace('.*SPEARFISHING.*','SPEARFISHING',regex=True,inplace=True)
df['Activity'].replace('.*DIVING.*','DIVING',regex=True,inplace=True)
df['Activity'].replace(['.*SURFING','KITE BOARDING','.*SKIING'],'SURFING',regex=True,inplace=True)
df['Activity'].replace(['.*KAYAK.*','.*BOAT.*','CANOEING','ROWING','SAILING','FISHING FOR MACKEREL'],'ON BOAT',regex=True,inplace=True)
df['Activity'].replace(['TREADING WATER','FLOATING ON HIS BACK'],'FLOATING',inplace=True)
df['Activity'].replace(['.*OVERBOARD.*','JUMPED INTO THE WATER'],'FELL INTO THE WATER',regex=True,inplace=True)
df['Activity'].replace('FREEDOM SWIMMING','SWIMMING',inplace=True)
df['Activity'].replace('SURF FISHING','WADE FISHING',inplace=True)
df['Activity'].replace(['SITTING ON SURFBOARD','SURFING (SITTING ON HIS BOARD)','PADDLE BOARDING','STAND-UP PADDLEBOARDING','PADDLING ON SURFBOARD'],'ON SURFBOARD',inplace=True)
df['Activity'].replace(['.{,30} SHARK.','SHARK RELATED ACTIVITY.*'],'SHARK RELATED ACTIVITY',regex=True,inplace=True)

In [ ]:
mask =df['Activity'].value_counts().loc[df['Activity'].value_counts() < 5].index
df.loc[df['Activity'].isin(mask),'Activity'] = 'OTHER'
df['Activity'].value_counts().head(30)

OTHER              1738
Surfing            1072
Swimming            922
Fishing             468
Spearfishing        366
Wading              166
Bathing             163
Diving              135
Snorkeling          114
Standing            110
Scuba diving         81
Body boarding        63
Body surfing         50
Swimming             47
Boogie boarding      40
Kayaking             37
Treading water       33
Pearl diving         32
Fell overboard       32
Free diving          30
Windsurfing          19
Boogie Boarding      17
Walking              17
Floating             16
Fishing              16
Canoeing             16
Shark fishing        15
Surf fishing         14
Surf-skiing          13
Scuba Diving         12
Name: Activity, dtype: int64

## ***Column Species***

In [ ]:
df['Species'] = df['Species'].str.upper()
df['Species'].replace(['.*UNCONFIRMED.*','.* NOT CONFIRMED.*',
                                '.*QUESTIONABLE.*', '.*FOOT SHARK.*',
                                '.*SMALL SHARK.*', '.*FROM SHARK.*',
                                '.*FEMALE SHARK.*', '.*LARGE SHARK.*',
                                '.*BUT SHARK.*', '.*JUVENILE SHARK.*',
                                '.*THE SHARK.*','.*TWO SHARK.*',
                                '.*ANOTHER SHARK.*','.*KG SHARK.*',
                                '.*SEVERAL SHARK.*','.*SAME SHARK.*',
                                '.*GROUND SHARK.*'],
                               np.nan,regex=True,inplace=True)

In [ ]:
df['Species'] = df[df['Species'].notnull()]['Species'].str.findall('\w{3,} SHARK')
df['Species'] = df['Species'].apply(lambda x : ' OR '.join(x) if x == x else x)

In [ ]:
df.loc[df['Species'] == df['Species'], 'Species']
df.loc[df['Species'].notnull() & df['Species'].str.contains(' OR '),'Species'] = np.nan
df.loc[df['Species'] == '','Species'] = np.nan

In [ ]:
df['Species'].value_counts().head(20)

WHITE SHARK          668
TIGER SHARK          281
BULL SHARK           192
NURSE SHARK          107
BLACKTIP SHARK        76
REEF SHARK            73
WHALER SHARK          68
MAKO SHARK            55
WOBBEGONG SHARK       49
SPINNER SHARK         48
HAMMERHEAD SHARK      44
RAGGEDTOOTH SHARK     43
BLUE SHARK            40
LEMON SHARK           39
ZAMBESI SHARK         29
WHITETIP SHARK        28
SANDTIGER SHARK       25
SAND SHARK            17
DUSKY SHARK           12
SEVENGILL SHARK       11
Name: Species, dtype: int64

In [ ]:
df['Species'].isna().sum()

23790

In [ ]:
df['Species'].fillna('Unknown',inplace=True)

## ***Column Area***

In [ ]:
df['Area'].value_counts()

Florida                                       1128
New South Wales                                511
Queensland                                     339
Hawaii                                         326
California                                     311
                                              ...
Between Beira & Maputo                           1
Viti Levu group                                  1
Ambergris Caye                                   1
Island of St. Thomas                             1
On the Kowloon penisula, south of Sai Kung       1
Name: Area, Length: 864, dtype: int64

In [ ]:
df["Area"]= df["Area"].fillna("Unspecified")

In [ ]:
count = df['Area'].value_counts()
count[count > 25]
df=df[df['Area'].isin(count[count >25].index)]
df["Area"].value_counts()

Unspecified              19599
Florida                   1128
New South Wales            511
Queensland                 339
Hawaii                     326
California                 311
KwaZulu-Natal              217
Western Australia          213
Western Cape Province      195
South Carolina             166
Eastern Cape Province      166
North Carolina             116
South Australia            108
Victoria                    92
Pernambuco                  77
Texas                       77
North Island                74
Torres Strait               70
New Jersey                  54
Tasmania                    44
South Island                41
New York                    33
Oregon                      31
Abaco Islands               29
Name: Area, dtype: int64

## ***COLUMN DATE***

In [ ]:
def find_month(string):
    months = ["Jan","Feb","Mar","Apr","May","Jun","Jul","Aug","Sep","Oct","Nov","Dec"]
    #If it founds the info of a month, it returns it as an output of this cleaning function
    try:
        for month in months:
            if re.search(month,string):
                return month
    except TypeError:
        pass

df['Month'] = df['Date']    
df['Month'] = df['Date'].apply(find_month)
df['Month'].fillna(value="Unk",inplace=True)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  # This is added back by InteractiveShellApp.init_path()

In [ ]:
df['Date'].sample(20)

24250            NaN
8934             NaN
8521             NaN
12147            NaN
8737             NaN
7664             NaN
10190            NaN
5819     31-Dec-1908
22926            NaN
13000            NaN
3569     02-May-1976
21912            NaN
14145            NaN
15954            NaN
19725            NaN
20384            NaN
21237            NaN
21435            NaN
11749            NaN
25763            NaN
Name: Date, dtype: object

In [ ]:
df['Date'] = df['Date'].str.upper()
df['Date'] = df['Date'].str.lstrip('REPORTED ')
df['Date'] = pd.to_datetime(df['Date'],errors='coerce', format='%d-%b-%Y')

In [ ]:
df.loc[df['Date'].notnull(),'Date'].sample(20)

5718   1915-01-13
364    2018-07-13
1150   2012-06-26
1949   2005-07-01
2554   1998-07-25
5192   1939-01-12
6350   1863-02-05
533    2017-04-11
1961   2005-05-28
6358   1862-12-04
4109   1963-12-21
2250   2002-03-25
3843   1968-10-13
490    2017-07-20
2296   2001-08-19
6029   1895-06-03
5248   1937-02-03
2768   1995-04-13
3091   1988-10-06
2222   2002-07-04
Name: Date, dtype: datetime64[ns]

## ***COLUMN YEAR***

In [ ]:
df[df['Year'].notnull()]['Year'].value_counts().head(10)

2015.0    125
2016.0    106
2014.0    106
2017.0    103
2013.0    100
2012.0     99
2008.0     95
2009.0     94
2018.0     93
2007.0     91
Name: Year, dtype: int64

In [ ]:
df['Year'].replace(0,np.nan,inplace=True)
df['Year'] = pd.to_numeric(df['Year'], errors='coerce', downcast='integer')
df['Year'].value_counts().head(20)

2015.0    125
2016.0    106
2014.0    106
2017.0    103
2013.0    100
2012.0     99
2008.0     95
2009.0     94
2018.0     93
2007.0     91
2019.0     89
2005.0     88
2006.0     87
2011.0     84
2000.0     80
2020.0     77
2001.0     77
2003.0     76
2021.0     74
2002.0     73
Name: Year, dtype: int64

## ***Column Sex***

In [ ]:
df['Sex'].value_counts()

M      3981
F       528
N         2
M         2
lli       1
Name: Sex, dtype: int64

In [ ]:
df['Sex'] = df['Sex'].str.strip()
df['Sex'].replace(['N','.','lli'],np.nan,inplace=True)
df['Sex'].value_counts()

M    3983
F     528
Name: Sex, dtype: int64

## ***Column Activity***

In [ ]:
df['Activity'] = df['Activity'].str.strip()
df['Activity'] = df['Activity'].str.upper()
df['Activity'].value_counts().head(20)

OTHER              1133
SURFING             995
SWIMMING            675
FISHING             327
SPEARFISHING        239
WADING              139
BATHING             106
STANDING             92
DIVING               77
SNORKELING           74
BODY BOARDING        60
SCUBA DIVING         56
BOOGIE BOARDING      51
BODY SURFING         43
KAYAKING             35
TREADING WATER       31
PEARL DIVING         27
FREE DIVING          24
FELL OVERBOARD       24
SURF SKIING          21
Name: Activity, dtype: int64

In [ ]:
df['Activity'].replace(['JUMPING','STANDING','WADING','WALKING','PLAYING','SPLASHING','DANGLING FEET IN THE WATER'],'BATHING',inplace=True)
df['Activity'].replace(['BODY SURFING','BOOGIE BOARDING','BODY-BOARDING'],'BODY BOARDING',inplace=True)
df['Activity'].replace('.*SPEARFISHING.*','SPEARFISHING',regex=True,inplace=True)
df['Activity'].replace('.*DIVING.*','DIVING',regex=True,inplace=True)
df['Activity'].replace(['.*SURFING','KITE BOARDING','.*SKIING'],'SURFING',regex=True,inplace=True)
df['Activity'].replace(['.*KAYAK.*','.*BOAT.*','CANOEING','ROWING','SAILING','FISHING FOR MACKEREL'],'ON BOAT',regex=True,inplace=True)
df['Activity'].replace(['TREADING WATER','FLOATING ON HIS BACK'],'FLOATING',inplace=True)
df['Activity'].replace(['.*OVERBOARD.*','JUMPED INTO THE WATER'],'FELL INTO THE WATER',regex=True,inplace=True)
df['Activity'].replace('FREEDOM SWIMMING','SWIMMING',inplace=True)
df['Activity'].replace('SURF FISHING','WADE FISHING',inplace=True)
df['Activity'].replace(['SITTING ON SURFBOARD','SURFING (SITTING ON HIS BOARD)','PADDLE BOARDING','STAND-UP PADDLEBOARDING','PADDLING ON SURFBOARD'],'ON SURFBOARD',inplace=True)
df['Activity'].replace(['.{,30} SHARK.','SHARK RELATED ACTIVITY.*'],'SHARK RELATED ACTIVITY',regex=True,inplace=True)

In [ ]:
mask = df['Activity'].value_counts().loc[df['Activity'].value_counts() < 5].index
df.loc[df['Activity'].isin(mask),'Activity'] = 'OTHER'
df['Activity'].value_counts().head(30)

OTHER                     1139
SURFING                   1055
SWIMMING                   676
BATHING                    364
FISHING                    327
SPEARFISHING               242
DIVING                     223
BODY BOARDING              154
ON BOAT                     84
SNORKELING                  74
FLOATING                    47
ON SURFBOARD                35
FELL INTO THE WATER         31
WADE FISHING                14
SHARK RELATED ACTIVITY      12
SHARK FISHING               11
SEA DISASTER                 6
Name: Activity, dtype: int64

## ***Exporting***

In [ ]:
df.drop(columns=['Location','Case Number'])

            Date    Year  Sex        Type  ...   Age Fatal (Y/N)         Time Month
0     2021-09-10  2021.0    M         NaN  ...   NaN     Unknown  Unspecified   Sep
1     2021-09-09  2021.0    M  Unprovoked  ...   NaN           N    afternoon   Sep
2     2021-09-05  2021.0    M  Unprovoked  ...  31.0           Y  day-morning   Sep
4     2021-08-28  2021.0    M  Unprovoked  ...   NaN           N  day-morning   Aug
6     2021-08-21  2021.0    M  Unprovoked  ...  41.0           N  day-morning   Aug
...          ...     ...  ...         ...  ...   ...         ...          ...   ...
25822        NaT     NaN  NaN         NaN  ...   NaN     Unknown  Unspecified   Unk
25823        NaT     NaN  NaN         NaN  ...   NaN     Unknown  Unspecified   Unk
25824        NaT     NaN  NaN         NaN  ...   NaN     Unknown  Unspecified   Unk
25825        NaT     NaN  NaN         NaN  ...   NaN     Unknown  Unspecified   Unk
25826        NaT     NaN  NaN         NaN  ...   NaN     Unknown  Unspecified   Unk

[24017 rows x 12 columns]

In [ ]:
dfinal = df.sort_values('Country',ascending=True)

display(dfinal)

         Case Number       Date    Year  ... Fatal (Y/N)         Time Month
6442    1846.09.30.R 1846-09-30  1846.0  ...           Y  Unspecified   Sep
6451    1844.07.16.R        NaT  1844.0  ...           Y  Unspecified   Unk
4528      1958.09.13 1958-09-13  1958.0  ...           Y    afternoon   Sep
6352   1863.00.00.R4        NaT  1863.0  ...           Y  day-morning   Unk
6515    1808.06.01.R 1808-05-01  1808.0  ...     Unknown  Unspecified   May
...              ...        ...     ...  ...         ...          ...   ...
25822            NaN        NaT     NaN  ...     Unknown  Unspecified   Unk
25823            NaN        NaT     NaN  ...     Unknown  Unspecified   Unk
25824            NaN        NaT     NaN  ...     Unknown  Unspecified   Unk
25825            NaN        NaT     NaN  ...     Unknown  Unspecified   Unk
25826            NaN        NaT     NaN  ...     Unknown  Unspecified   Unk

[24017 rows x 14 columns]

In [ ]:
export_csv = dfinal.to_csv ('/content/sample_data/sharkcleanedFile.csv', index=None, header=True)